########################
# taps
########################

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "danielfoehrkn/switch"
tap "go-task/tap"
tap "zegervdv/zathura"

########################
# brew
########################

brew "ansible"
brew "topgrade"
brew "thefuck"
brew "tmux"
brew "rclone"
brew "fping"

brew "bat"
brew "eza"
brew "tree"
brew "lf"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "gnu-tar"
brew "jq"
brew "unzip"
brew "go-task/tap/go-task"
brew "btop"
brew "lnav"
brew "podman"

brew "wget"
brew "telnet"
brew "httpie"
brew "bind"  # dns utils

brew "tldr"
brew "hyperfine"
brew "fastfetch"
brew "onefetch"

brew "pipx"
brew "cri-tools"
brew "kubectx"
brew "openshift-cli"
brew "k9s"
brew "danielfoehrkn/switch/switch"

brew "git"
brew "git-delta"

brew "micro"
brew "neovim"
brew "zathura"
brew "zathura-pdf-poppler"
brew "pandoc"

brew "bash"
brew "zsh"

brew "autoconf"
brew "coreutils"
brew "pkg-config"

########################
# casks
########################

# cask "firefox"

cask "alacritty"
cask "podman-desktop"
cask "github"

cask "goland"
cask "pycharm-ce"
cask "visual-studio-code"

cask "dbeaver-community"
cask "mongodb-compass"

cask "karabiner-elements"

cask "drawio"
cask "xournal-plus-plus"

########################
# fonts
########################

cask "font-jetbrains-mono-nerd-font"
